public class HW5P4 {
   /* Задачи на циклы, вывести следующие строки с соответствующим форматированием (как пирамиды):


    Задача №1

            0  1  2  3  4  5  6  7  8  9
            0  1  2  3  4  5  6  7  8
            0  1  2  3  4  5  6  7
            0  1  2  3  4  5  6
            0  1  2  3  4  5
            0  1  2  3  4
            0  1  2  3
            0  1  2
            0  1
            0


    Задача №2

           0  1  2  3  4  5  6   7   8  9
               0  1  2  3  4  5  6   7  8
                   0  1  2  3  4  5  6  7
                      0  1  2  3  4  5  6
                         0  1  2  3  4  5
                            0  1  2  3  4
                               0  1  2  3
                                   0  1  2
                                      0  1
                                         0



    Задача №3

            9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9
            8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8
            7 6 5 4 3 2 1 0 1 2 3 4 5 6 7
            6 5 4 3 2 1 0 1 2 3 4 5 6
            5 4 3 2 1 0 1 2 3 4 5
            4 3 2 1 0 1 2 3 4
            3 2 1 0 1 2 3
            2 1 0 1 2
            1 0 1
            0
*/
}
